logs/average_benchmark_20250710_044111/benchmark_runs/run_05/h3_0ms_1pct.log
=== HTTP/3 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-10 04:36:30
Delay: 0ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 1000 total requests
spawning thread #1: 5 total client(s). 1000 total requests
spawning thread #2: 5 total client(s). 1000 total requests
spawning thread #3: 5 total client(s). 1000 total requests
spawning thread #4: 5 total client(s). 1000 total requests
spawning thread #5: 5 total client(s). 1000 total requests
spawning thread #6: 5 total client(s). 1000 total requests
spawning thread #7: 5 total client(s). 1000 total requests
spawning thread #8: 5 total client(s). 1000 total requests
spawning thread #9: 5 total client(s). 1000 total requests
spawning thread #10: 5 total client(s). 1000 total requests
spawning thread #11: 5 total client(s). 1000 total requests
spawning thread #12: 5 total client(s). 1000 total requests
spawning thread #13: 5 total client(s). 1000 total requests
spawning thread #14: 5 total client(s). 1000 total requests
spawning thread #15: 5 total client(s). 1000 total requests
spawning thread #16: 5 total client(s). 1000 total requests
spawning thread #17: 5 total client(s). 1000 total requests
spawning thread #18: 5 total client(s). 1000 total requests
spawning thread #19: 5 total client(s). 1000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 1.10s, 18242.20 req/s, 5.01MB/s
requests: 20000 total, 20000 started, 20000 done, 20000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 20000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 5.50MB (5762877) total, 4.12MB (4318958) headers (space savings 26.80%), 1.18MB (1240000) data
UDP datagram: 4205 sent, 6217 received
                     min         max         mean         sd        +/- sd
time for request:      775us    393.79ms     95.79ms    104.81ms    82.58%
time for connect:    73.04ms       1.04s    153.93ms    242.13ms    93.00%
time to 1st byte:    84.93ms       1.05s    223.97ms    242.63ms    93.00%
req/s           :     183.49     1560.50      743.00      365.82    73.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 9000 total requests
spawning thread #1: 5 total client(s). 9000 total requests
spawning thread #2: 5 total client(s). 9000 total requests
spawning thread #3: 5 total client(s). 9000 total requests
spawning thread #4: 5 total client(s). 9000 total requests
spawning thread #5: 5 total client(s). 9000 total requests
spawning thread #6: 5 total client(s). 9000 total requests
spawning thread #7: 5 total client(s). 9000 total requests
spawning thread #8: 5 total client(s). 9000 total requests
spawning thread #9: 5 total client(s). 9000 total requests
spawning thread #10: 5 total client(s). 9000 total requests
spawning thread #11: 5 total client(s). 9000 total requests
spawning thread #12: 5 total client(s). 9000 total requests
spawning thread #13: 5 total client(s). 9000 total requests
spawning thread #14: 5 total client(s). 9000 total requests
spawning thread #15: 5 total client(s). 9000 total requests
spawning thread #16: 5 total client(s). 9000 total requests
spawning thread #17: 5 total client(s). 9000 total requests
spawning thread #18: 5 total client(s). 9000 total requests
spawning thread #19: 5 total client(s). 9000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 13.08s, 13762.70 req/s, 3.80MB/s
requests: 180000 total, 180000 started, 180000 done, 180000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 180000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 49.75MB (52162517) total, 37.23MB (39038302) headers (space savings 26.54%), 10.64MB (11160000) data
UDP datagram: 21225 sent, 43622 received
                     min         max         mean         sd        +/- sd
time for request:     2.34ms       1.69s    660.39ms    223.40ms    71.62%
time for connect:    17.00ms     99.44ms     66.97ms     27.09ms    71.00%
time to 1st byte:    19.93ms    547.72ms    112.65ms     97.96ms    89.00%
req/s           :     137.73      165.06      142.27        5.47    85.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/3 (confirmed)
Fair Comparison: Enabled
Warmup Requests: 20000
Measurement Requests: 180000
End Time: 2025-07-10 04:36:49
CSV Log: /logs/benchmark_20250710_043531/h3_0ms_1pct.csv